src/InformationRegisters/цур_РеестрВидовМетаданных/цур_РеестрВидовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_РеестрВидовМетаданных</name>
  <resources>
    <name>ИмяКоллекцииМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяДляXML</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяКоллекцииРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлементаРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступныеПрава</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ГруппыВложенных</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>GeneratedTypes</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СинонимМн</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/цур_ОбновлениеДанных/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет первоначальное заполнение или обновление данных регистра сведений
// цур_РеестрВидовМетаданных данными о видах метаданных 1С.
//
Процедура ОбновитьДанные() Экспорт

	ЗаполнитьРеестрВидовМетаданных();

КонецПроцедуры

// Проверяет, была ли выполнена инициализация. Если нет — запускает начальное заполнение.
// Вызывается при начале работы системы.
//
Процедура ПроверитьИнициализацию() Экспорт

	Если Константы.цур_ИнициализацияВыполнена.Получить() Тогда
		Возврат;
	КонецЕсли;

	ОбновитьДанные();
	Константы.цур_ИнициализацияВыполнена.Установить(Истина);

КонецПроцедуры

// Заполняет регистр сведений цур_РеестрВидовМетаданных данными обо всех поддерживаемых
// видах метаданных 1С. Источник данных — JSON-макет цур_РеестрВидовМетаданныхJSON.
// Существующие записи перезаписываются полностью.
//
Процедура ЗаполнитьРеестрВидовМетаданных() Экспорт

	ОписанияВидов = ОписанияВидовИзМакета();

	НаборЗаписей = РегистрыСведений.цур_РеестрВидовМетаданных.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	Для Каждого Описание Из ОписанияВидов Цикл

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ВидМетаданных                = Описание["ВидМетаданных"];
		НоваяЗапись.ИмяКоллекцииМетаданных       = Описание["ИмяКоллекцииМетаданных"];
		НоваяЗапись.ИмяДляXML                    = Описание["ИмяДляXML"];
		НоваяЗапись.ИмяКоллекцииРасширения       = Описание["ИмяКоллекцииРасширения"];
		НоваяЗапись.ИмяЭлементаРасширения        = Описание["ИмяЭлементаРасширения"];
		НоваяЗапись.ДоступныеПрава               = СериализоватьВJSON(Описание["ДоступныеПрава"]);
		НоваяЗапись.ГруппыВложенных              = СериализоватьВJSON(Описание["ГруппыВложенных"]);
		НоваяЗапись.GeneratedTypes               = СериализоватьВJSON(Описание["GeneratedTypes"]);
		НоваяЗапись.Порядок                      = Описание["Порядок"];
		НоваяЗапись.Синоним                      = Описание["Синоним"];
		НоваяЗапись.СинонимМн                    = Описание["СинонимМн"];

	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

// Возвращает версию набора данных реестра видов метаданных для контроля актуальности.
//
// Возвращаемое значение:
//  Строка - версия данных в формате "мажор.минор.патч"
//
Функция ВерсияДанных() Экспорт

	Возврат "2.0.0";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Читает JSON-макет цур_РеестрВидовМетаданныхJSON и возвращает массив описаний видов метаданных.
//
// Возвращаемое значение:
//  Массив из Соответствие - каждый элемент содержит поля описания одного вида метаданных
//
Функция ОписанияВидовИзМакета()

	ТекстJSON = ПолучитьОбщийМакет("цур_РеестрВидовМетаданныхJSON").ПолучитьТекст();

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);

	Возврат ПрочитатьJSON(ЧтениеJSON, Истина);

КонецФункции

// Сериализует значение (Массив или Структуру/Соответствие) в строку JSON.
//
// Параметры:
//  Значение - Произвольный - значение для сериализации
//
// Возвращаемое значение:
//  Строка - JSON-представление значения
//
//BSLLS:Typo-off
Функция СериализоватьВJSON(Значение)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, Значение);

	Возврат ЗаписьJSON.Закрыть();

КонецФункции
//BSLLS:Typo-on

#КонецОбласти
